# CutMarkSymbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CutMarkSymbol Property
ParameterTypeId Class See Also
---
"Cut Mark Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CutMarkSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CutMarkSymbol As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CutMarkSymbol {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace